Public Attributes | List of all members
API_AttributeFolderContent Struct Reference
Attribute Management
Content of an attribute folder. Contains direct subfolders and attributes. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 GS::Array< API_AttributeFolder >  | subFolders
Subfolders in this folder.
 GS::Array< GS::Guid >  | attributeIds
Attributes in this folder.
Detailed Description
Content of an attribute folder. Contains direct subfolders and attributes.
Since
Archicad 26
Remarks
The name of the folder is not used.